{
  "title": "About Jay",
  "copy": "I am a software developer based in the Seattle area with a Bachelor's degree in Computer Science and over a decade of experience in a wide range of technical disciplines, but particularly in webapp development. If you are looking for a developer with cross-discipline knowledge, who can quickly pick up and apply whatever technologies are needed for the project at hand, [send me a message](/#contact).",
  "skillsSection": [
    {
      "header": "Development",
      "copy": "My career began with front end development, and I still maintain an opinionated passion about making technology comprehensible and accessible for every audience. I've since grown into a full-stack developer and can comfortably handle all layers of the typical webapp, from provisioning to database creation to API development. I keep current with new technology -- currently, I'm focusing on the Node.js ecosystem, especially React, but I have experience with a multitude of languages and technology and I'm always excited to develop new skills."
    },
    {
      "header": "Design",
      "copy": "Beyond technology, my two main passions are writing and visual art. Development, especially front end development, is about more than the code. The most beautifully coded webapp will still fail if users don't want to or can't use it. With a strong background in visual art, I understand concepts like negative space, color harmony, visual symmetry, and can work with design teams to ensure their vision is properly translated to the application itself."
    },
    {
      "header": "Communication",
      "copy": "Writing code is one thing, but occasionally developers need to talk to actual people. As a developer with background in IT, I know how important it is to be able to communicate with both technical and non-technical audiences. I am also a great believer in cross-department communication and have historically worked closely with marketing and design teams.\n\nCommunication is ultimately the purpose of all software development, and I strive to enable clear communication in all aspects of what I do, from managing projects to designing interfaces to the code itself."
    }
  ]
}
