{
  "title": "Previous Projects",
  "projectOrder": [
    "vsei",
    "vsmain",
    "vssearch",
    "xbox",
    "reinav",
    "cheeztv",
    "mtrlike",
    "mtradmin",
    "test"
  ],
  "projects": {
    "cheeztv": {
      "title": "Cheezburger TV",
      "thumbnail": "cheez-pre.png",
      "year": "2014",
      "uri": "https://cheezburger.com",
      "copy": "*Unfortunately, this webapp has since been removed from the live site. The link provided is to the main site, which does not necessarily contain my work.*\n\nA single page webapp, created for the Cheezburger website. The intent was to create a video player flexible enough to handle multiple video types with minimal to no interruption to the user experience.\n\nThe app is made up of three main views -- the video container, the main video, and the navigation ribbon. The container behaves like other content blocks on the site, accepting social media plugins that can be customized by non-technical users on the site admin.\n\nUsing the navigation ribbon, users can page through video thumbnails and manually select the video of their choice. An autoplay feature was also implemented, with a visible countdown that the user was able to cancel. This required manual implementation, since the app required autoplay to function across video APIs. Communication of state between each view was accomplished via the window.postMessage methods. was accomplished by using the window.postMessage method. On request, certain partners altered their APIs to enable compatibility with this service, most notably [CollegeHumor](CollegeHumor.com)",
      "tech": [
        [ "window.postMessage", "https://developer.mozilla.org/en-US/docs/Web/API/Window/postMessage" ],
        "3rd party video APIs",
        [ "Backbone.js", "https://backbonejs.org/" ],
        [ "ASP.NET", "https://dotnet.microsoft.com/apps/aspnet" ],
        [ "Bootstrap", "https://getbootstrap.com/" ],
        "Custom CMS"
      ]
    },
    "mtrlike": {
      "title": "Meteor Solutions Like Tool",
      "thumbnail": "liketool-pre.png",
      "year": "2012",
      "copy": "The Meteor Solutions Like Tool implements popular social media like buttons in a way that allows Meteor tracking code to record each button's social reach. This data is then made available in the campaign dashboard, providing the campaign's administrators with information about its effectiveness.\n\nOn the campaign dashboard, users can access an interface that allows them to create this tool in a WISYWIG manner, making it available to non-technical users such as campaign admins. I was responsible for both the tool itself and the customization interface.\n\nThe interface has two main views -- the config view and the WISYWIG view, which generates the tool's UI using the same code as the live version. The JavaScript block is displayed at the bottom and updates with each change. The tool's configuration can be saved to the campaign dashboard; subsequent loads will show these settings.\n\nDocumentation, including advanced configuration, is provided on a separate page for technical users who have experience in JavaScript.",
      "tech": [
        [ "Django", "https://www.djangoproject.com/" ],
        [ "Bootstrap", "https://getbootstrap.com/" ],
        [ "jQuery", "https://jquery.com/" ]
      ]
    },
    "mtradmin": {
      "title": "Meteor Solutions Admin Dashboard",
      "thumbnail": "admindash-pre.png",
      "year": "2011-12",
      "copy": "The Meteor Solutions admin dashboard provides a integrated data view for organizations who are using Meteor Solutions code to track multiple ad campaigns. Previously, users had to go to each campaign page, individually download data, and build their own spreadsheets to analyze it.",
      "tech": [
        [ "Django", "https://www.djangoproject.com/" ],
        [ "Bootstrap", "https://getbootstrap.com/" ],
        [ "jQuery", "https://jquery.com/" ]
      ]
    },
    "reinav": {
      "title": "REI Navigation",
      "thumbnail": "rei-pre.png",
      "year": "2015",
      "uri": "https://rei.com",
      "copy": "Although I did not spend long at REI, I was able to finish the header, footer, and mobile menu of the REI main site for the circa 2015 redesign. I used elements from the component library, suggesting edits as needed.\n\n*Live site code does not necessarily contain my work.*",
      "tech": [
        "UI component library",
        "Standard web stack"
      ]
    },
    "vsmain": {
      "title": "Visit Seattle Main Website",
      "thumbnail": "banner_styled.png",
      "year": "2016-19",
      "uri": "https://visitseattle.org",
      "copy": "The main Visit Seattle homepage. For three years, one of my primary duties was maintaining this website, which while I was there <traffic stuff>. In addition to responding to user requests, I proactively made visual improvements, organized the code base, and maintained stability and security of the server itself. Below are examples of my day to day work maintaining this website.\n\n *The live site likely still contains much of my work, though I cannot confirm this.*",
      "tech": [
        "Custom WordPress",
        "SASS",
        "PHP5 & 7",
        "JavaScript",
        "MySQL",
        "CSS3",
        "API consumption"
      ]
    },
    "vssearch": {
      "title": "Visit Seattle Search",
      "thumbnail": "",
      "year": "2017",
      "uri": "https://visitseattle.org/?=ice+cream",
      "copy": "The search function in the Visit Seattle website, a highly customized replacement to the standard WordPress search. On the backend, search options are translated to custom MySQL queries. I was responsible for the backend -- the actual query building and execution -- as well as the user interface. In addition to queries and filters, a semi-hidden field allows users to choose from sources customized to various user types (tourist, meeting planner, trip planner, etc.\n\n*The live site likely still contains my work, though I cannot guarantee this.*",
      "tech": [
        "Custom WordPress",
        "PHP5",
        "MySQL",
        "Standard web stack"
      ]
    },
    "vsem": {
      "title": "Visit Seattle Events Manager",
      "thumbnail": "",
      "year": "2019",
      "source": "https://github.com/jaybillings/events-manager-client-public",
      "copy": [
        "A React webapp providing a user-friendly visual interface for managing listings of events."
      ],
      "tech": [
        "React",
        "FeathersJS",
        "MariaDB",
        "Knex.js",
        "socket.io",
        "ECMAScript 6",
        "vanilla CSS"
      ]
    },
    "vsei": {
      "title": "Visit Seattle Events Importer",
      "thumbnail": "importer-request.png",
      "year": "2018",
      "source": "",
      "copy": "Two plugins for retrieving information from external APIs and consuming it as a WordPress data type. The plugins are largely the same, with variations having to do with the difference between data.",
      "tech": [
        "PHP7",
        "WordPress plugins",
        "MySQL"
      ]
    },
    "vspi": {
      "title": "Visit Seattle Partners Importer",
      "thumbnail": "importer-partners-advanced.png",
      "year": "2018",
      "source": "",
      "copy": "",
      "tech": [
        "PHP7",
        "WordPress plugins",
        "MySQL"
      ]
    },
    "xbox": {
      "title": "Xbox One Purchase Flow",
      "thumbnail": "Purchase-NuiVui.png",
      "year": "2014",
      "uri": "https://xbox.com",
      "copy": "The purchase flow for the Xbox One console. In coordination with the Reach team at Microsoft, I helped create views for the console settings, which were created with Ember.js and consumed byb the console.\n\n*Live site is not an example of my work, which is consumed by the Xbox One console.*",
      "tech": [
        "Ember.js",
        "Node.js",
        ".NET",
        "Xbox One platform",
        "Standard web stack"
      ]
    },
    "test": {
      "title": "The Test Project With the Very Long Name",
      "thumbnail": "https://via.placeholder.com/250/cccccc.png",
      "year": "20XX",
      "source": "https://github.com",
      "copy": "Nemo enim ipsam voluptatem quia voluptas sit aspernatur aut odit aut fugit,\n\nsed quia consequuntur magni dolores eos qui ratione voluptatem sequi nesciunt.",
      "tech": [
        "HTML",
        "CSS",
        "LESS",
        "Angular"
      ]
    }
  }
}
