{
  "title": "Previous Projects",
  "projectOrder": [
    "vsem",
    "vsemserver",
    "vspivsei",
    "vsmain",
    "vssearch",
    "xbox",
    "mtrlike",
    "mtradmin",
    "reinav",
    "cheeztv"
  ],
  "projects": {
    "cheeztv": {
      "title": "Cheezburger TV",
      "thumbnail": "cheez-pre.png",
      "year": "2014",
      "uri": "https://cheezburger.com",
      "copy": "*Unfortunately, this webapp has since been removed from the live site. The link provided is to the main site, which does not necessarily contain my work.*\n\nA single page webapp, created for the Cheezburger website. The request was to create a video player flexible enough to handle multiple video providers with minimal or no interruption to the user experience.\n\nThe app is made up of three main views -- the video container, the main video, and the navigation ribbon. The container behaves like other content blocks on the site, accepting social media plugins which can be customized by non-technical publishers.\n\nUsing the navigation ribbon, users can page through video thumbnails and manually initiate playback. Videos also autoplay, which is indicated by a cancel-able countdown.\n\nCommunication of state between various video APIs accomplished via `window.postMessage`. On request, certain partners altered their APIs to enable compatibility with this service, most notably [CollegeHumor](CollegeHumor.com).",
      "tech": [
        [ "window.postMessage", "https://developer.mozilla.org/en-US/docs/Web/API/Window/postMessage" ],
        "3rd party video APIs",
        [ "Backbone.js", "https://backbonejs.org/" ],
        [ "ASP.NET", "https://dotnet.microsoft.com/apps/aspnet" ],
        [ "Bootstrap", "https://getbootstrap.com/" ],
        [ "jQuery", "https://jquery.com/" ],
        "Custom CMS"
      ]
    },
    "mtrlike": {
      "title": "Meteor Solutions Like Tool",
      "thumbnail": "liketool-google.png",
      "year": "2012",
      "copy": "Created for Meteor Solutions, the Like Tool wraps Meteor Solutions' tracking code around popular social media widgets. This provides ad campaign administrators an additional data source for assessing the reach of their campaigns. These data, along with others, are made available on the campaign's dashboard.\n\nIn addition to implementing the widgets themselves, I created a dashboard page that allows users to customize the widgets in a WISYWIG manner. Since individual campaigns implement these widgets within a variety of contexts, the tool was created with flexibility in mind. The WISYWIG editor provides the most common implementation and customization options, but a documentation page describes more advanced options for technically inclined users.",
      "tech": [
        [ "Django", "https://www.djangoproject.com/" ],
        [ "Python 2.7", "https://www.python.org/download/releases/2.7/" ],
        [ "Bootstrap", "https://getbootstrap.com/" ],
        [ "jQuery", "https://jquery.com/" ]
      ]
    },
    "mtradmin": {
      "title": "Meteor Solutions Admin Dashboard",
      "thumbnail": "admindash-pre.png",
      "year": "2011-12",
      "copy": "The Meteor Solutions admin dashboard provides an integrated data view for organizations that use Meteor Solutions' code to track multiple ad campaigns. Previously, data views were only available per-campaign, meaning users had to manually compile various data sources for multi-campaign assessments.",
      "tech": [
        [ "Django", "https://www.djangoproject.com/" ],
        [ "Python 2.7", "https://www.python.org/download/releases/2.7/" ],
        [ "Bootstrap", "https://getbootstrap.com/" ],
        [ "jQuery", "https://jquery.com/" ]
      ]
    },
    "reinav": {
      "title": "REI Navigation",
      "thumbnail": "rei-pre.png",
      "year": "2015",
      "uri": "https://rei.com",
      "copy": "*Live site code does not necessarily contain my work.*\n\nThe header, footer, and mobile menu of the REI main site for the circa 2015 redesign. To maintain compatibility with the rest of the codebase, I used elements from the component library as much as possible, suggesting edits where necessary.",
      "tech": [
        "Internal UI component library",
        "Standard web stack"
      ]
    },
    "vsmain": {
      "title": "Visit Seattle Main Website",
      "thumbnail": "banner_styled.png",
      "year": "2016-19",
      "uri": "https://visitseattle.org",
      "copy": "*As of February 2020, the live site still contains much of my work.*\n\nThe homepage of Visit Seattle, a destination marketing organization for the city of Seattle. My work on this site was wide-ranging and not limited to the web layer -- I also maintained the server and supporting technologies.\n\nThis gallery includes examples of the work I did with the design team to maintain site main site on the frontend.",
      "tech": [
        [ "WordPress", "https://wordpress.org/" ],
        [ "SASS", "https://sass-lang.com/" ],
        [ "Backbone.js", "https://backbonejs.org/" ],
        [ "PHP5 & 7", "https://www.php.net/" ],
        [ "MySQL", "https://www.mysql.com/" ],
        [ "AWS", "https://aws.amazon.com/" ],
        [ "jQuery", "https://jquery.com/" ],
        [ "Advanced Custom Fields (plugin)", "https://www.advancedcustomfields.com/" ],
        [ "Gravity Forms (plugin)", "https://www.gravityforms.com/" ],
        [ "Cookie Content Banner Generator", "https://www.websitepolicies.com/cookie-consent-banner-generator" ],
        "API consumption"
      ]
    },
    "vssearch": {
      "title": "Visit Seattle Search",
      "thumbnail": "results-rainier-partners.png",
      "year": "2017",
      "uri": "https://visitseattle.org/?=ice+cream",
      "copy": "*As of February 2020, the live site still contains much of my work.*\n\nThe search function for the Visit Seattle website, a highly customized replacement to the built-in WordPress search that implements ordering search results by relevancy.\n\nThe Visit Seattle website has a number of custom WordPress taxonomies, each with a number of metadata, which provide the filters and sub-filters for search results. Each possible match has a relevancy weight (from 0 to 1), which is configurable on  the WordPress admin. Considering the complicated nature of the search class, I took care to lay out the codebase in a logical manner that future coders can quickly comprehend.\n\nWorking with design, I also updated the front-end, in particular the 'top results' view, which displays a configurable number of results for each matched taxonomy.",
      "tech": [
        [ "WordPress", "https://wordpress.org/" ],
        [ "SASS", "https://sass-lang.com/" ],
        [ "PHP5 & 7", "https://www.php.net/" ],
        [ "MySQL", "https://www.mysql.com/" ],
        [ "jQuery", "https://jquery.com/" ]
      ]
    },
    "vsem": {
      "title": "Visit Seattle Events Manager (Client)",
      "thumbnail": "",
      "year": "2019",
      "source": "https://github.com/jaybillings/events-manager-client-public",
      "copy": "*Images coming soon.*\n\nA React webapp created for Visit Seattle. An update to an out-of-date .NET application, it provides a user-friendly interface which allows content authors to import, edit, and export data relating to local events. Data is imported from a 3rd party via either JSON or XML files. This data consists of event listings, various metadata listings, and the connections between them. As a requirement, all unapproved data is saved as 'pending', with pending data being inaccessible to public API endpoints. After import, all pending listings are displayed on a single page where they can be edited and marked for 'publishing' to live tables. For quality control purposes, live data can only be edited by super-users and admins $mdash; default users can only copy live listings and then edit them as pending. \n\nThis application is designed to be standalone, so administrative tasks such as user creation and modification have been included. Also included is an admin section, which is available to super-users and admins, though the available functions aren't the same. Super-users and admins are able to change the mappings between Tags and Neighborhoods, which is necessary given that Visit Seattle and the 3rd party data source don't use the same levels of fidelity. True administrators can also add, remove, and modify user accosts. \n\nOverall, the UX is designed to present complicated data in a widely comprehensible manner and provide simple, easy-to-understand functions for data manipulation. Care has been taken to provide an intuitive interaction flow for each user level, with actions provided depending on context and permissions level. Whenever possible, visual elements such as layout and color have been used in addition to text to provide context.",
      "tech": [
        [ "React", "https://reactjs.org/" ],
        [ "Feathers", "https://feathersjs.com/" ],
        [ "socket.io", "https://socket.io/" ],
        [ "ECMAScript 6", "http://www.ecma-international.org/ecma-262/6.0/" ],
        [ "SASS", "https://sass-lang.com/" ]
      ]
    },
    "vsemserver": {
      "title": "Visit Seattle Events Manager (Server)",
      "thumbnail": "",
      "year": "2019",
      "source": "https://github.com/jaybillings/events-manager",
      "copy": "The server code for the Visit Seattle Events Manager, written using Feathers, Node.js framework. It replaces an older, out-of-date .NET application. As the name suggests, the Events Manager manages data related to local Seattle events. It provides endpoints to the [Events Manager Client](/gallery/vsem) as well as the [Events Importer plugin](/gallery/vspivsei), which ingests data as custom WordPress taxonomy for display on the Visit Seattle website.\n\nBecause it was written in Feathers, each model is mapped to a single table and created with a set of CRUD endpoints. Several custom endpoints are also present: an 'importer' endpoint that ingests data from a structured XML file, an 'exporter' endpoint that exports all data in one of two formats, and an 'api' endpoint that runs specific query actions that allow external sources to maintain current event listings. All publicly accessible endpoints are authenticated via an api key, which can be generated on the client.\n\nOther than events, the server code establishes and manages a number of database tables representing metadata and the associations between metadata and listings. As a requirement for the project, data must be approved before becoming available to the API, with edits preserved between sessions. To satisfy this requirement, each live table has a matching '-pending' table, representing unapproved data inaccessible to public endpoints. Because of this, schema is crafted such that pending data can be associated with live data. Further complicating the application's overall data structure, the 3rd party data source does not map certain data in the same way as Visit Seattle, which is addressed when importing and exporting. \n\nTo simplify the process of tracking event listings, separate tables track added and removed listings by ID; these are made available to external sources via two public endpoints. To avoid side-effects in CRUD operations, the client is responsible for editing these tables when events are added and removed. \n\nWhenever possible, this application has been optimized for reliability, maintainability, and speed. This is particularly important for the 'import' endpoint, which has to process large amounts of data as quickly as possible while sending progress updates to the client. To this aim, the import runs via a series of well-defined steps, with each step representing the ingestion of a specific schema. Steps are organized to minimize requests and minimize data corruption when handling errors. At the end of each step, the server emits a 'status' message to the client. ",
      "tech": [
        [ "Feathers", "https://feathersjs.com/" ],
        [ "Express", "https://expressjs.com/" ],
        [ "Knex.js", "http://knexjs.org/" ],
        [ "SQLite", "https://www.sqlite.org/index.html" ],
        [ "MariaDB", "https://mariadb.org" ],
        [ "Ajv", "https://www.npmjs.com/package/ajv" ],
        [ "Passport", "https://www.npmjs.com/package/passport" ],
        [ "ECMAScript 6", "http://www.ecma-international.org/ecma-262/6.0/" ]
      ]
    },
    "vspivsei": {
      "title": "Visit Seattle Partners/Events Importer",
      "thumbnail": "importer-partners-advanced.png",
      "year": "2018",
      "source": [
        {
          "name": "Partners",
          "uri": "https://github.com/jaybillings/vs-wp-partners-importer-public"
        }, {
          "name": "Events",
          "uri": "https://github.com/jaybillings/vs-wp-events-importer-public"
        }
      ],
      "copy": "Two highly similar plugins created for Visit Seattle, the Importers are designed to import 3rd party data as a custom WordPress taxonomy, either \"Partners\" or \"Events\". The plugins refresh their listings on a scheduled basis, via cron, and provide interfaces on the client admin for manual actions.\n\nThese plugins were requested as a functioning version of the plugins provided by the original site authors, which had availability and consistency issues stemming from PHP's limitations on requests. To overcome these issues, the new plugins' server actions are additive, atomic, and operate over a subset of listings. This is what makes it possible for the client to handle the overall process, since each phase is discrete and can be individually requested, and also makes it possible to cancel and resume processes. Here as everywhere, care has been taken to structure the code for comprehensibility and maintainability.\n\nAlthough imports run automatically, there is also an admin client which allows users to manually refresh data. The client has two views -- basic, for non-technical users who only want to refresh the data; and advanced, for technical users who need to manage the dataset on a larger scale.",
      "tech": [
        [ "WordPress", "https://wordpress.org/" ],
        "WordPress plugins",
        [ "SASS", "https://sass-lang.com/" ],
        [ "PHP7", "https://www.php.net/" ],
        [ "MySQL", "https://www.mysql.com/" ],
        [ "jQuery", "https://jquery.com/" ],
        "SimpleView API"
      ]
    },
    "xbox": {
      "title": "Xbox One Purchase Flow",
      "thumbnail": "Purchase-NuiVui.png",
      "year": "2014",
      "copy": "In coordination with the Reach team, I implemented views for the Xbox One, in particular the purchase flow. Originally hired for my front-end skills, I was also able to fully contribute to service, routing, and component development.",
      "tech": [
        "Ember.js",
        "Node.js",
        ".NET",
        "Xbox One platform",
        "Standard web stack"
      ]
    },
    "test": {
      "title": "The Test Project With the Very Long Name",
      "thumbnail": "goat-blep.jpg",
      "year": "20XX",
      "uri": "https://scribbleowl.com",
      "source": "https://github.com",
      "copy": "Nemo enim ipsam voluptatem quia voluptas sit aspernatur aut odit aut fugit,\n\nsed quia consequuntur magni dolores eos qui ratione voluptatem sequi nesciunt.",
      "tech": [
        "HTML",
        "CSS",
        "LESS",
        "Angular"
      ]
    }
  }
}
